esp8266/Arduino/libraries/ESP8266WiFi/src/ESP8266WiFiGeneric.cpp
    return (err == ERR_OK) ? 1 : 0;
}

#if LWIP_IPV4 && LWIP_IPV6
int ESP8266WiFiGenericClass::hostByName(const char* aHostname, IPAddress& aResult, uint32_t timeout_ms, DNSResolveType resolveType)
{
    ip_addr_t addr;
    err_t err;
    aResult = static_cast<uint32_t>(INADDR_NONE);

    if(aResult.fromString(aHostname)) {
        // Host name is a IP address use it!
        DEBUG_WIFI_GENERIC("[hostByName] Host: %s is a IP!\n", aHostname);
        return 1;
    }

    DEBUG_WIFI_GENERIC("[hostByName] request IP for: %s\n", aHostname);
    switch(resolveType)
    {
      // Use selected addrtype
      case DNSResolveType::DNS_AddrType_IPv4:
      case DNSResolveType::DNS_AddrType_IPv6:
      case DNSResolveType::DNS_AddrType_IPv4_IPv6:
      case DNSResolveType::DNS_AddrType_IPv6_IPv4:
         err = dns_gethostbyname_addrtype(aHostname, &addr, &wifi_dns_found_callback, &aResult, (uint8_t) resolveType);
	 break;
      default:
         err = dns_gethostbyname_addrtype(aHostname, &addr, &wifi_dns_found_callback, &aResult, LWIP_DNS_ADDRTYPE_DEFAULT); // If illegal type, use default.
	 break;
    }

    if(err == ERR_OK) {
        aResult = IPAddress(&addr);
    } else if(err == ERR_INPROGRESS) {
        _dns_lookup_pending = true;
        delay(timeout_ms);
        // will resume on timeout or when wifi_dns_found_callback fires
        _dns_lookup_pending = false;
        // will return here when dns_found_callback fires
        if(aResult.isSet()) {
            err = ERR_OK;
        }
    }

    if(err != 0) {
        DEBUG_WIFI_GENERIC("[hostByName] Host: %s lookup error: %d!\n", aHostname, (int)err);
    } else {
        DEBUG_WIFI_GENERIC("[hostByName] Host: %s IP: %s\n", aHostname, aResult.toString().c_str());
    }

    return (err == ERR_OK) ? 1 : 0;
}
#endif

/**
 * DNS callback
 * @param name
 * @param ipaddr
 * @param callback_arg
 */
void wifi_dns_found_callback(const char *name, const ip_addr_t *ipaddr, void *callback_arg)
{
    (void) name;
    if (!_dns_lookup_pending) {
        return;
    }
    if(ipaddr) {
        (*reinterpret_cast<IPAddress*>(callback_arg)) = IPAddress(ipaddr);
    }
    esp_schedule(); // break delay in hostByName
}

uint32_t ESP8266WiFiGenericClass::shutdownCRC (const WiFiState& state)
{
    return crc32(&state.state, sizeof(state.state));
}

bool ESP8266WiFiGenericClass::shutdownValidCRC (const WiFiState& state)
{
    return crc32(&state.state, sizeof(state.state)) == state.crc;
}

bool ESP8266WiFiGenericClass::shutdown (WiFiState& state, uint32 sleepUs)
{
    bool persistent = _persistent;
    WiFiMode_t before_off_mode = getMode();

    if (before_off_mode & WIFI_STA)
    {
        bool ret = wifi_get_ip_info(STATION_IF, &state.state.ip);
        if (!ret)
        {
            DEBUG_WIFI("core: error with wifi_get_ip_info(STATION_IF)\n");
            return false;
        }
        memset(state.state.fwconfig.bssid, 0xff, 6);
        ret = wifi_station_get_config(&state.state.fwconfig);
        if (!ret)
        {
            DEBUG_WIFI("core: error with wifi_station_get_config\n");
            return false;
        }
        state.state.channel = wifi_get_channel();
    }

    // disable persistence in FW so in case of power failure
    // it doesn't wake up in off mode.
    // persistence state will be restored on WiFi resume.
    WiFi.persistent(false);
    if (!WiFi.forceSleepBegin(sleepUs))
    {
        // WIFI_OFF mode set by forceSleepBegin()
        DEBUG_WIFI("core: error with forceSleepBegin()\n");
        WiFi.mode(before_off_mode);
        WiFi.persistent(persistent);
        return false;
    }

    // WiFi is now in force-sleep mode
    // finish filling state and process crc

    state.state.persistent = persistent;
    state.state.mode = before_off_mode;

    uint8_t i = 0;
    for (auto& ntp: state.state.ntp)
    {
        ntp = *sntp_getserver(i++);
    }
    i = 0;

    for (auto& dns: state.state.dns)
    {
        dns = WiFi.dnsIP(i++);
    }

    state.crc = shutdownCRC(state);
    DEBUG_WIFI("core: state is saved\n");

    return true;
}

bool ESP8266WiFiGenericClass::shutdown (WiFiState& state) {
    return shutdown(state, 0);
}

bool ESP8266WiFiGenericClass::resumeFromShutdown (WiFiState& state)
{
    ESP.forcedModemSleepOff();

    if (shutdownCRC(state) != state.crc)
    {
        DEBUG_WIFI("core: resume: bad crc\n");
        return false;
    }

    persistent(state.state.persistent);

    if (!mode(state.state.mode))
    {
        DEBUG_WIFI("core: resume: can't set wifi mode to %d\n", state.state.mode);
        return false;
    }

    if (state.state.mode & WIFI_STA)
    {
        IPAddress local(state.state.ip.ip);
        if (local)
        {
            DEBUG_WIFI("core: resume: static address '%s'\n", local.toString().c_str());
            WiFi.config(state.state.ip.ip, state.state.ip.gw, state.state.ip.netmask, state.state.dns[0], state.state.dns[1]);
            uint8_t i = 0;
            for (const auto& ntp: state.state.ntp)
            {
                IPAddress ip(ntp);
                if (ip.isSet())
                {
                    DEBUG_WIFI("core: resume: start SNTP, server='%s'\n", ip.toString().c_str());
                    sntp_setserver(i++, &ntp);
                }
            }
        }

        String ssid;
        {
            const char* ptr = reinterpret_cast<const char*>(state.state.fwconfig.ssid);
            ssid.concat(ptr, strnlen(ptr, sizeof(station_config::ssid)));
        }

        String pass;
        {
            const char* ptr = reinterpret_cast<const char*>(state.state.fwconfig.password);
            pass.concat(ptr, strnlen(ptr, sizeof(station_config::password)));
        }

        auto beginResult = WiFi.begin(ssid.c_str(),
                       pass.c_str(),
                       state.state.channel,
                       state.state.fwconfig.bssid,
                       true);
        if (beginResult == WL_CONNECT_FAILED)
        {
            DEBUG_WIFI("core: resume: WiFi.begin failed\n");
            return false;
        }
        if (beginResult == WL_WRONG_PASSWORD)
        {
            DEBUG_WIFI("core: resume: WiFi.begin wrong password\n");
            return false;
        }
    }

    if (state.state.mode & WIFI_AP)
    {
        DEBUG_WIFI("core: resume AP mode TODO\n");
        return false;
    }

    // success, invalidate saved state
    state.crc++;

    return true;
}

void ESP8266WiFiGenericClass::preinitWiFiOff () {
    // It was meant to be called from user-defined ::preinit()
    // It is now deprecated by enableWiFiAtBootTime() and __disableWiFiAtBootTime()
}
